생활코딩 – Node.js

1.	수업소개
-	1990년 웹의 등장으로 종이에 있던 정보들이 다 웹페이지로 옮겨지기 시작함
-	웹사이트 소유자가 직접 html태그를 작성하고 수정하는 것이 힘들어지기 시작 -> 귀찮고 반복되는 html작성을 기계에게 시켜야겠다 생각
-	자바스크립트는 웹브라우저에서 유일하게 사용할 수 있는 독점적인 컴퓨터 프로그래밍 언어였으나 웹 브라우저에서만 갇혀있었음
-	2008년 v8엔진을 기반으로 하는 node.js를 개발
-	Node.js: 자바스크립트를 이용해서 웹브라우저가 아닌 컴퓨터 자체를 제어 ->
-	개발자들은 이미 익숙한 자바스크립트를 이용해서 웹페이지를 자동으로 생성하는 웹 애플리케이션을 만들 수 있게 됨, 따라서 개발자들은 컨텐츠를 생산하는 창의적인 일에 집중하면 됨 

2.	수업의 목적
: 수업을 통해서 완성할 웹 애플리케이션이 어떤 기능이 있는지를 소개
-	웹사이트에는 많은 웹페이지가 있음: 각각의 웹페이지에 html태그를 바꿔야 할 경우? Node.js를 사용하면 template.js이라는 한 파일만 바꾸면 연관된 모든 페이지에서 html태그가 바뀜: 사용자가 어떤 페이지를 요청할때마다 Node.js을 이용해서 그 순간 웹페이지를 생성하기 때문 
-	또한 node.js를 이용해서 웹사이트에 방문한 사용자에게 컨텐츠의 읽기, 쓰기, 수정, 삭제 기능을 제공해줄 수 있음 

3.	설치
4.	공부 방법
-	자바스크립트 문법 -> node.js runtime 기능 -> 기능을 활용한 웹애플리케이션 제작
-	이미 자바스크립트 문법을 알고있다면 해당 동영상 넘겨도 됨 

5.	웹서버 만들기
-	Node.js.는 아파치같은 웹서버를 내장하고 있음 
-	
